src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ЗапросыСКлиентаВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦену(Период, Номенклатура) Экспорт
	
	Перем Результат;

	ЗапросЦенНаДату = Новый Запрос;
	
	ЗапросЦенНаДату.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
		|		ЦеныНоменклатурыСрезПоследних";
		
		ЗапросЦенНаДату.УстановитьПараметр("Период", Период);
		ЗапросЦенНаДату.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = ЗапросЦенНаДату.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Цена;
		
	Иначе
		
		Результат = 0;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти
